<template>
  <div>
    <div>
      <img style="margin-left:40%;" alt="" width="20%" :srcset="coin.logourl"/>
    </div>
    <div v-if="this.$i18n.locale == "zh"">
      <div class="introtext" v-if="cointype === coins[0].cointype">
比特币介绍：根据中本聪的思路设计发布的开源软件以及建构其上的P2P网络。比特币是一种P2P形式的数字货币。点对点的传输意味着一个去中心化的支付系统。与大多数货币不同，比特币不依靠特定货币机构发行，它依据特定算法，通过大量的计算产生，比特币经济使用整个P2P网络中众多节点构成的分布式数据库来确认并记录所有的交易行为，并使用密码学的设计来确保货币流通各个环节安全性。P2P的去中心化特性与算法本身可以确保无法通过大量制造比特币来人为操控币值。基于密码学的设计可以使比特币只能被真实的拥有者转移或支付。这同样确保了货币所有权与流通交易的匿名性。比特币与其他虚拟货币最大的不同，是其总数量非常有限，具有极强的稀缺性。
纪念币人物：中本聪
人物国籍：日本可能性40,美国可能性40%，来自其他国家概率20% 
人物身份：比特币创始人，区块链技术创始人
人物介绍：中本聪到底是一个人，还是一个团队，还是一个国家目前无从得知，目前有人自称自己是中本聪但还未经过详细考证，暂且把他的形象作为中本聪吧。他在全球金融危机的背景下创立了比特币试图打开一个去中心化的货币体系，同时，也把区块链技术带到了世界，让去中心化的理念深入人心，他引来的区块链技术即将爆发出新的一场科技革命，他是当之无愧的区块链祖师爷。
      </div>
      <div class="introtext" v-if="cointype === coins[1].cointype">
以太币介绍：Ethereum（以太坊）是一个平台和一种编程语言，使开发人员能够建立和发布下一代分布式应用。 Ethereum可以用来编程，分散，担保和交易任何事物：投票，域名，金融交易所，众筹，公司管理， 合同和大部分的协议，知识产权，还有得益于硬件集成的智能资产。
以太坊将使用混合型的安全协议，前期使用工作量证明机制（POW），用于分发以太币，然后会切换到权益证明机制（POS）。自上线时起，每年都将有0.26x，即每年有60102216 * 0.26 = 15626576个以太币被矿工挖出。转成POS后，每年产出的以太币将减少
纪念币人物：V神(VitalikButerin)
人物国籍：加拿大（出生地：俄罗斯）
人物身份：以太坊创始人
人物介绍：1994年出生的天才程序员神通，4岁就接触电脑，12岁就自己编程游戏，17岁时接触比特币，接触比特币后，对区块链产生了宗教般的狂热，毅然退学从事区块链事业，另起炉灶，召集近20位合作伙伴，投入自己同年获得10万美元创业奖学金缔造以太坊帝国，从此让区块链进入了2.0智能合约时代。真可谓英雄出少年。他执着，低调，讲话毫无遮掩，杜绝跟风，他告诫所有以太坊的用户成熟起来，不希望以太币沦为人们投机生财的“郁金香”。他还警告炒以太币暴富的人如果还在用炒以太币币赚来的钱炫富，他将退出以太坊。
      </div>
      <div class="introtext" v-if="cointype === coins[2].cointype">
莱特币介绍：莱特币Litecoin（简写：LTC，货币符号：Ł）是一种基于“点对点”(peer-to-peer)技术的网络货币，也是MIT/X11许可下的一个开源软件项目。它可以帮助用户即时付款给世界上任何一个人。莱特币从比特币衍生出来，最早通过采用占用内存更多的Scrypt算法以及将出块时间从10分钟改成了2.5分钟而大获成功。
莱特币受到了比特币（BTC）的启发，并且在技术上具有相同的实现原理，莱特币的创造和转让基于一种开源的加密协议，不受到任何中央机构的管理。莱特币旨在改进比特币，与其相比，莱特币具有三种显著差异。第一，莱特币网络每2.5分钟（而不是10分钟）就可以处理一个块，因此可以提供更快的交易确认。第二，莱特币网络预期产出8400万个莱特币，是比特币网络发行货币量的四倍之多。第三，莱特币在其工作量证明算法中使用了由Colin Percival首次提出的scrypt加密算法，这使得相比于比特币，在普通计算机上进行莱特币挖掘更为容易。每一个莱特币被分成100,000,000个更小的单位，通过八位小数来界定。
纪念币人物：李启威
人物国籍：美国（出生地：科特迪瓦）
人物身份：莱特币创始人，COINBASE交易所前工程总监
人物介绍：麻省理工学院高材生，最初从介绍暗网的文章中了解了比特币，感受到比特币的神奇，立志要开发出自己的数字货币。对数字货币创始人先挖出大量自己创始的币，然后再投放市场的模式极为不满，他要用一种公平的模式打造自己的数字货币。他大胆预言：“虚拟货币最终会实现流通货币的作用。”他还热衷慈善，捐赠大量莱特币给慈善事业。他的名言：“比特币是金，莱特币是银。”
      </div>
      <div class="introtext" v-if="cointype === coins[3].cointype">
币安币介绍：币安币是由币安发行的代币，简称BNB，是基于以太坊Ethereum的去中心化的区块链数字资产。BNB作为Binance生态系统和去中心化交易所燃料，已经应用到多个场景，如用BNB抵扣binance交易手续费，最高可获得50%的折扣，在Monaco Visa及APP应用中可使用BNB支付，在Uplive直播平台可以使用BNB购买虚拟礼物等。目前 BNB 排名稳居全球TOP50，最佳排名为全球TOP20，受到全球180余国家和地区区块链爱好者的支持。
纪念币人物：赵长鹏
人物国籍：加拿大（出生地：中国）
人物身份：币安交易所创始人
人物介绍：2018年福布斯数字货币领域富豪榜第三名，大胆卖房炒币并开交易所，短短六个月就曾让币安成为世界数字货币交易量第一的交易所。程序员出身，为人低调，拥有惊人财富的赵长鹏没有任何汽车、游艇或名表。他永远满仓持有比特币，银行卡里只保留几千用于日常生活开支。数国的政界大佬邀请他前往当地开展区块链合作。他的名言：“没人能够改变我的看法，我改变他们的可能性或许更多一点。”
      </div>
      <div class="introtext" v-if="cointype === coins[4].cointype">
韭菜币介绍：现实中没有以人民为代表的加密货币，所以此款游戏中会有一款以广大散户为主题的纪念币弥补现实中的缺失。加密纪念币团队希望不久未来在现实中能有一款以人民为主题的加密货币发行，没有割韭菜，没有庄家操纵。
纪念币人物：梭哈老者
人物国籍：中国
人物身份：打捞员
人物介绍：梭哈老者是一名尸体打捞员。凭啥纪念币人物里只能有大咖，我们韭菜必须也要有一席之地。梭哈老头代表了众多韭菜心声，其经典名言：“不要怂，就是干！全梭哈！赢了会所嫩模，输了下海干活”已经流传佳话。我们广大普通投资人在区块链里可谓体验了人生的酸甜苦辣和人生百态。区块链技术最终是要服务于广大投资者的。梭哈老者的经典梭哈表情和手势已经伸入人心，他当之无愧应成为广大散户的代表。
      </div>
      <div class="introtext" v-if="cointype === coins[5].cointype">
嫩模币介绍：OmiseGO 通过开发新一代支付服务来解决支付处理商、网关以及金融机构之间基本的协调问题。该支付服务支持在货币及资产类型间进行转换操作。通过 OmiseGO 网络和电子钱包，每个人都可以完全分散，高频和低成本的方式进行诸如付款、汇款、工资发放、B2B 商务、供应链融资、忠诚度计划（loyalty programs）、资产管理以及其他按需服务等金融交易。此外，世界上最大的增长经济体用户将能从使用法币转向使用类似以太币和比特币等去中心化货币。OmiseGo 网络不再区分法币还是去中心化加密货币：随着更多的人接受和使用，最好用的货币将胜出。
OmiseGO 是公开的基于以太坊的可实现主流数字钱包跨区域跨组织交易的金融科技，打破支付孤岛，完成实时的点对点价值交换和支付服务，并支持跨法币与去中心化货币的交易。该技术旨在通过打破现有的组织架构壁垒，推进金融包容性，并将在2017年第四季度启动，通过 OmiseGO 及其数字钱包网络，向所有人提供服务。
OmiseGO 通过开发新一代支付服务来解决支付处理商、网关以及金融机构之间基本的协调问题。该支付服务支持在货币及资产类型间进行转换操作。通过 OmiseGO 网络和电子钱包，终端用户可以灵活完成支付、汇款、薪水存储、B2B 商业、供应链融资、信用制度、资产管理和贸易以及各种随需应变的金融服务。具体而言，可在国内外迅速移动资金、在大型组织的各部门中获取跟踪资产的安全分类账、为品牌联盟建立信用积分系统、向可支持多个钱包供应商的网络发放数字礼品卡等。
此外，世界上最大的增长经济体用户将能从使用法币转向使用类似以太币和比特币等去中心化货币。OmiseGo 网络不再区分法币还是去中心化加密货币：随着更多的人接受和使用，最好用的货币将胜出。
纪念币人物：Jun Hasegawa
人物国籍：日本
人物身份：嫩模币（OMG）创始人
人物介绍：他的区块链项目要开创东南亚地区移动支付的先河，立志要打破银行的垄断，他们的口号简单粗暴：让你们不再需要银行！他已经成功地与两家世界500强企业合作，泰国麦当劳就已经率先接受OMISEGO的支付服务，此外，在他的努力下，OMISE还与中国企业巨头阿里集团在泰国开展支付业务。
      </div>
      <div class="introtext" v-if="cointype === coins[6].cointype">
阿姨币介绍：æternity是一个区块链3.0平台，旨在提供无与伦比的效率，透明的治理和全球可扩展性。AE区块链的核心基础之一是智能合约，提供几乎即时和完全私人的交易。它还具有无限可扩展性，并实现了具有工作量证明（PoW）和利益证明（PoS）的混合共识机制。Aeternity的技术亮点是Bitcoin-NG协议、图灵完备状态通道(State Channels)、去中心化预言机（Oracles）、命名系统，用于用户友好的地址名称。
纪念币人物：YanislavMalahov
人物国籍：瑞士（出生地：保加利亚）
人物身份：阿姨（AE）创始人，以太坊教父
人物介绍：被誉为“以太坊教父”，以太坊诞生之前，就已经和V神一起工作，在与V神的思想碰撞中，以太坊的雏形概念诞生了。没有他，以太坊或许要晚很久诞生，甚至无法诞生。他的阿姨币被称为欧洲版以太坊。他大胆预言:“5年内加密货币将角逐出胜者，大部分垫脚石将消失”。2018年良币驱逐劣币，他的预言进一步实现。他在经历过金融危机后，认为区块链技术将是人类未来的必经之路。
      </div>
      <div class="introtext" v-if="cointype === coins[7].cointype">
小蚁币介绍：NEO是基于区块链技术，将实体世界的资产进行数字化，形成数字资产，并通过点对点网络进行登记存管、转让交易、清算交收的去中心化分布式总账协议。
NEO使用电子合同（e-contract）来记录数字资产的流转。在NEO中，电子合同所产生的数字凭证（digital token）作为一种通用的底层数据，可以用于记录股权、债权、证券、金融合约、积分、票据、货币等各种权利和资产，用于股权众筹、股权交易、员工持股计划、P2P借贷、积分、基金、供应链金融等领域
纪念币人物：达鸿飞
人物国籍：中国
人物身份：小蚁（NEO）创始人
人物介绍：江湖人称达叔，真名宋欢平。他于2011年接触比特币，2013年全职从事区块链技术创新、数字货币社区工作，联合创立了“比特创业营”。创业者、投资人、消费升级爱好者三位为一体的区块链大咖。他提出了区块链1.0时代，区块链2.0时代。2014年创立小蚁。2015年起开始主持“小蚁”项目，用区块链技术让普通公司都可以进行“数字IPO”，发行股权，交易股权。他认为：首先，区块链必须结合身份认证，才能合规地对接实体世界的财产权利，才能进入主流应用；其次，区块链在保持公开透明性的同时，也必须保护使用者的隐私，才能被用户所接受。
      </div>
      <div class="introtext" v-if="cointype === coins[8].cointype">
泰达币介绍：USDT的发行和交易使用的是Omni（原Mastercoin）协议，而Omni币可以说是市面上的第一个基于比特币区块链的2.0币种。所以USDT的交易确认等参数是与比特币一致的。
根据Tether的CTO及联合创始人Craig Sellars 称，用户可以通过SWIFT电汇美元至Tether公司提供的银行帐户，或通过Bitfinex交易所换取USDT。赎回美元时，反向操作即可。用户也可在上述两个网站用比特币换取USDT。其网站宣称严格遵守1：1的准备金保证，即每发行1枚USDT代币，其银行帐户都会有1美元的资金保障。
纪念币人物：Craig Sellars
人物国籍：美国
人物身份：泰达（Tether)公司联合创始人兼CTO
人物介绍：美元作为背书，他掌门的泰达公司每一枚USDT对等一美元，把真实货币带入到数字货币世界，某种程度扮演了中心化央行的角色，币圈有时也需要一些中心化。投资者无需担心法币比特币和以太坊作为法币时的价格波动，USDT是名副其实的稳定币种，避险港湾。他是名副其实的法币数字化的鼻祖，为法币全球360度顺畅地流通打下扎实基础。
      </div>
      <div class="introtext" v-if="cointype === coins[9].cointype">
石油币介绍：石油币是第一个由主权国家发行并具有自然资源作为支撑的加密数字货币，将被用来进行国际支付，成为委内瑞拉在国际上融资的一种新方式。这一数字货币将帮助委内瑞拉渡过经济困难，打破美国的金融封锁。每个石油币都有委内瑞拉的1桶原油作为实物抵押。委内瑞拉的石油币计划一路走来，从市场到政界，吸引了国内外不少眼光。
纪念币人物：Nicolás Maduro Moros
人物国籍：委内瑞拉
人物身份：委内瑞拉总统，石油币发起人
人物介绍：委内瑞拉经济崩盘，通货膨胀，负债累累，区块链的出现让他看到了救命稻草，他力排众议促使委内瑞拉发型石油币进行融资，成为第一个发型数字货币的国家，一币对标一桶石油。石油币发行首日，委内瑞拉就融资到7.35亿美元。他的伟大实践证明了区块链有希望能拯救一个国家。同时，在他执政期间，邀请全世界人民前来挖矿，外加低廉的电费和政府补贴，成为矿工们的首选挖矿地。
      </div>
      <div class="introtext" v-if="cointype === coins[10].cointype">
门罗币介绍：门罗币（Monero，代号XMR）是一个创建于2014年4月开源加密货币，它着重于隐私、分权和可扩展性。与自比特币衍生的许多加密货币不同，Monero基于CryptoNote协议，并在区块链模糊化方面有显著的算法差异。Monero的模块化代码结构得到了比特币核心维护者的赞赏。
Monero致力于成为可代替的不可追踪的电子货币。相比比特币及其分叉，Monero具有更高程度的匿名性。 Monero于2014年4月18日发布。
纪念币人物：Riccardo Spagni
人物国籍：南非
人物身份：门罗创始人
人物介绍：Riccardo Spagni,有情报学和物流学教育背景，曾经做过软件开发和进出口贸易，2011年接触比特币，2012年开始从事区块链项目开发。兴趣广泛，多才多艺，热爱大海中划橡皮艇运动，喜欢动物，自己养了六条狗，与海豹接吻，热衷于自己制造无人机和使用无人机航拍，此外他还喜欢玩热高。他十分注重保护用户的隐私和匿名性，因此，他开发的门罗币应运而生。
      </div>
      <div class="introtext" v-if="cointype === coins[11].cointype">
量子币介绍：量子链Qtum是首个基于UTXO模型的POS智能合约平台，可以实现和比特币生态和以太坊生态的兼容性，并通过移动端的战略，促进区块链技术的产品化和提高区块链行业的易用性，旨在将真实商业社会与区块链世界连接。因此，量子链是一个区块链应用平台的集大成者。
量子链利用其学术合作伙伴、开发工具和方法论对商业智能合约的开发进行了标准化，包括将自然语言的合约准确的转译成机器可读智能合约、高容错度的细节及合约条款。第三方将在量子链的协助下开发专用的用户接口来加强智能合约生命周期管理。
量子链旨在通过与一系列合作伙伴和第三方的协作建立一个智能合约枢纽，提供安全并经过反复测试的合约模板，适用于各种行业和用例，例如供应链管理、通讯、物联网、社交媒体等。
纪念币人物：帅初
人物国籍：中国
人物身份：量子链（Qtum）创始人
人物介绍：区块链狂热信徒，博士辍学，离开阿里，开创自己区块链事业。比特币创立早期，他就在比特币和区块链论坛大量发帖，累计发帖数过万，撰写了《从0到1建立自己的区块链》开发手册。网罗世界顶级区块链大咖，创立量子链（Qtum）,被V神称为“中国乃至亚洲最好的区块链团队”，2017年进入福布斯中国30岁精英榜。他的霸气名言：“如果在历史上找一个人对标中本聪，我想那个人应该是牛顿或者香农”。
      </div>
      <div class="introtext" v-if="cointype === coins[12].cointype">
比原币介绍：比原链 (Bytom）是一种多元比特资产的交互协议，运行在比原链区块链上的不同形态的、异构的比特资产（原生的数字货币、数字资产）和原子资产（有传统物理世界对应物的权证、权益、股息、债券、情报资讯、预测信息等）可以通过该协议进行登记、交换、对赌、和基于合约的更具复杂性的交互操作。连通原子世界与比特世界，促进资产在两个世界间的交互和流转。比原链采用三层架构：应用层、合约层、数据层，应用层对移动终端等多终端友好，方便开发者便捷的开发出资产管理应用；合约层采用创世合约和控制合约进行资产的发行和管理，在底层支持扩展的UTXO模型BUTXO，对虚拟机做了优化，采用自省机制以防止图灵完备中的死搀状态；数据层使用分布式账本技术，实现资产的发行、花费、交换等操作，共识机制采用对人工智能ASIC芯片友好型POW算法，在哈希过程中引入矩阵和卷积计算，使得矿机在闲置或被淘汰后，可用于AI硬件加速服务，从而产生额外的社会效益。
纪念币人物：长铗（本名：刘志鹏）
人物国籍：中国
人物身份：比原链(Bytom)创始人、巴比特论坛创始人兼CEO、区块链理论研究者、地质工程师、科幻小说作家
人物介绍：跨领域多重身份，很难想象一个科幻作家、地质工程师能与区块链相结合。他开发的比原链币圈市值排名前50，他创立的巴比特论坛成为中国最大的区块链和数字货币论坛，内容丰富、人气十足,他写的科幻小说连续三年获中国科幻最高奖“银河奖”。区块链和科幻小说领域双重身份的他让枯燥、难懂、乏味的区块链理论变动生动活泼，区块链有时也需要科幻润色。高瞻远瞩，2011年就给大学生投资建议：“买比特币，保存好钱包文件，然后忘掉这回事。五年后再看看。”
      </div>
      <div class="introtext" v-if="cointype === coins[13].cointype">
火币积分介绍：HT（火币全球通用积分）是基于区块链发行和管理的积分系统，为火币官方发行的唯一积分。HT将支持火币全球业务、全线产品，如：VIP手续费折扣、认证商家保证金、火币积分专享活动、与热门币种交易、参与火币业务等。
纪念币人物：李林
人物国籍：中国
人物身份：火币交易所创始人
人物介绍：李林，同济大学本科，清华大学硕士，曾入职甲骨文公司。当他在2011年第一次阅读比特币白皮书时，被其中的原理吸引的如痴如醉。曾试图创办中国版脸书“友谊网”以失败告终，不气不馁，接着创办团购导航网站“人人折”，小有成就，乘胜追击，抓住商机，开设加密货币交易所火币网，大获成功。在他的努力下，火币交易所稳坐交易量前十。他的名言：“创业就是干别人不敢干的事。”
      </div>
      <div class="introtext" v-if="cointype === coins[14].cointype">
柚子币介绍：EOS (Enterprise Operation System) 是由 Block.one 公司主导开发的一种全新的基于区块链智能合约平台，旨在为高性能分布式应用提供底层区块链平台服务。EOS 项目的目标是实现一个类似操作系统的支撑分布式应用程序的区块链架构。该架构可以提供账户，身份认证，数据库，异步通信以及可在数以万计的 CPU/GPU 集群上进行程序调度和并行运算。EOS 最终可以支持每秒执行数百万个交易，同时普通用户执行智能合约无需支付使用费用。EOS 代币目前是 EOS 区块链基础设施发布的基于以太坊的代币，主要有三大应用场景：带宽和日志存储（硬盘），计算和计算储备（CPU），状态存储（RAM）。EOS主网上线后会将 ERC-20 代币 EOS 转换为其主链上的代币。
纪念币人物：BM(Dan Larimer)
人物国籍：美国
人物身份：EOS创始人，BTS创始人，Steem创始人
人物介绍：BM是区块链技术天才，链圈第一个连续开发的三个区块链项目市值都在前五十，尤其第三个项目EOS还没上线时市值就达到前五，受到信仰者的追捧。他设计出EOS21节点竞选制，堪比议会制，将人类优越的民主政治制度与区块链相结合，是一次伟大的创新。他是自由主义者，自由到极端，典型的极客型人格，对怂中本聪，对怂V神。惹来中本聪霸气十足的回复：看不懂就算了，我没时间搭理你。他给自己定下了乌托邦般的使命：我的人生目标是找到能确保大家生命、自由和财产安全的自由市场解决方案。为他的伟大理想给一个真诚的赞！
      </div>
      <div class="introtext" v-if="cointype === coins[15].cointype">
埃欧塔币介绍：IOTA是一种新型的数字加密货币，专注于解决机器与机器（M2M）之间的交易问题。通过实现机器与机器间无交易费的支付来构建未来机器经济（machine economy）的蓝图。IOTA提供高效，安全，轻便，实时的微交易，并且不产生交易费用。 它是开源的，去中心化的数字加密货币，是专门为物联网而设计的，它是实时微交易，并且能够简单方便的进行扩展。IOTA超越了blockchain技术。它是第一个用于整个生态系统的，基于非区块链技术加密货币。IOTA可能被认为又是一种山寨币，但事实是IOTA远非一种山寨币，它超越了区块链技术，是区块链技术的延展。IOTA是基于缠结（Tangle）而非区块链技术。
纪念币人物：David Sonstebo
人物国籍：挪威
人物身份：埃欧塔创始人
人物介绍：David Sonstebo满脸大胡子的形象好像带领我们回到了19世纪，然而他却是一个未来主义者。外表形象与内完全相反的一个人。他相信技术是从一种利他主义的角度来改善世界的最佳方法。他对任何能推动人类社会进步的技术都抱有极大热情，这样的热情使他成为了一个科技狂人，他的激情四射到了物联网、分布式账本、区块链、智慧城市、数字身份、政府管理电子化、硬件设计领域。
      </div>
      <div class="introtext" v-if="cointype === coins[16].cointype">
中币介绍: ZB是由ZB Blockchain基金会基于区块链发行的生态币，可以在ZB生态众多场景下使用并流通，目的是为了让用户可以在ZB生态体系中享有更多的权益，打通ZB生态全产业服务。ZB限定发行总量为21亿枚，用户持有7.47亿，4亿用于成立“ZB用户保障基金”，2.93亿用于平台运作及市场推广，6.6亿用于ZB生态基金。
纪念币人物：李大伟
人物国籍：中国
人物身份：中币交易所联合创始人，中币资本CEO
中币介绍：ZB是由ZB Blockchain基金会基于区块链发行的生态币，可以在ZB生态众多场景下使用并流通，让用户可以在ZB生态体系中享有更多的权益，打通ZB生态全产业服务。具体应用在投票、接收空投糖果、购买会员、享受手续费折扣。回购机制让ZB价值稳定。
人物介绍：外号“币圈老干部”。大学毕业后，李大伟进入世界五百强企业工作，之后又在多家五百强企业从事管理岗位，大企业的职业化训练让他积累了丰富的高新科技企业管理经验。2012年在网上偶遇比特币介绍，虽然看不懂难懂的白皮书，但隐约感觉到背后技术所带来的巨大市场。2013年毅然辞职进入币圈。与其他区块链从业者穿着随意不同，李大伟热爱始终西装革履。他不注重玩命造势地宣传中币交易所，而是选择务实路线，贴心为用户服务。他公开强调“区块链大佬站台的项目不一定就是好项目”。
      </div>
      <div class="introtext" v-if="cointype === coins[17].cointype">
恒星币简介:恒星币是基于 Ripple 代码修改创建的恒星支付网络中的基础数字货币，总量为1000亿，每年增加1%。恒星支付网络以恒星币为基础货币，用户能够通过其转账任意一种货币，包括美元、欧元、人民币、日元或者比特币，简便易行快捷，交易确认在几秒以内完成。
纪念币人物：Jed McCaleb
人物国籍：美国
人物身份：电驴创始人，瑞波币联合创始人，恒星币联合创始人，Mt.Gox交易所创始人
人物介绍：Jed从小就着迷于编程。他认为编程就像平地起高楼，从无到有，将一个想法变成一个美妙的成品。他身边堆满了神经科学和人工智能方面的书籍。对他而言，世界是美妙的，不符合很多人对“码农”们“死宅”的刻板映像。大学选择物理专业，他只花了一年就学完了相应的课程。对他来说，学习这些知识远远不需要4年时间，所以与其浪费接下来的三年时间，还不如腾出时间做更多有意义的事情，所以毅然选择退学。他创业经历丰富多彩，1998年筹备创建电驴，2010年创建游戏公司，2011年创建比特币交易所，2012年创建瑞波，因和瑞波CEO意见分歧，于2014年创建恒星。
      </div>
      <div class="introtext" v-if="cointype === coins[18].cointype">
艾达币介绍：Cardano卡尔达诺是一个分散且公开的区块链，也是一个加密货币项目，而且是完全开源的。卡尔达诺正在开发一个智能合约平台，旨在提供比以前开发的任何协议更先进的功能，它是第一个从科学哲学和以研究为首驱使向导，进而演变而来的区块链平台。
Cardano是从科学哲学领域开发出来的第一个区块链项目，也是由主导学者和工程师们组成的全球团队设计和制造的唯一项目。至关重要的是，Cardano的技术是安全、灵活和可扩展的，并可供数百万用户使用。因此，一些主导专家们已经对该项目进行过深思熟虑，并且设计决策也已成形。科学的严谨性被应用于关键任务的系统当中，比如航空航天技术和银行业已经被带入到数字货币领域当中，并且具有高度的安全保证。
纪念币人物：Charles Hoskinson
人物国籍：美国
人物身份：艾达币（ADA）创始人
人物介绍：区块链明星项目三任元老，以太坊（Ethereum），卡尔达诺（Cardano）和比特股（Bitshares）的联合开发者。他在接触比特币之后，毅然辞掉收入不菲的工作，投身区块链教育事业，当时身边人都认为他疯了。他曾和V神共同开发以太坊，因与V神意见产生分歧，独立门户，另辟蹊径，吸取了比特币和以太坊的优势，创始了卡尔达诺，集成了数字货币（如比特币，莱特币）和智能合约（如以太坊，EOS）的区块链生态系统。他坚定地认为华尔街最终会带着上万亿美元的资金进入加密货币市场，前途将一片光明。
      </div>
      <div class="introtext" v-if="cointype === coins[19].cointype">
狗币介绍：狗币自有一套策略，它并不走比特币的赚钱路线，而是很好地利用了美国的“小费文化”。这种被视作是对服务者的捐赠或跪拜的谦卑姿态，也在互联网上广泛使用。比起昂贵的比特币，狗币门槛更低，而且更“萌”，系统上线一周后，狗币已经成为美国互联网中第二受欢迎的“小费电子货币”。狗币很特别，基于网络草根文化而起，由于气质可爱搞笑而一炮而红。在日益膨胀的电子货币市场当中，狗币算是定位到一个利基市场。
纪念币人物：Jackson Palmer
人物国籍：澳大利亚
人物身份：狗币联合创始人，前ADOBE公司产品经理
人物介绍：他是一位大神级的市场营销专家，与一名素未见面的美国程序员一拍即合，创立狗币，弥补了币圈小费打赏币的空白，同时，他通过狗币开创了区块链与慈善、动物保护的完美结合，人气指数迅速爆棚。他的狗币看起来搞笑，叫起来也搞笑，给羞涩难懂的区块链技术增添了一丝幽默感。脸书网也向狗币抛出了橄榄枝，承认了狗币在脸书网上的合法地位。狗币的市值曾在最高峰达到10亿美元，他的成功再一次证明只要努力敢于创新，草根也能变大佬。
      </div>
      <div class="introtext" v-if="cointype === coins[20].cointype">
瑞波币介绍：瑞波币是Ripple网络的基础货币，它可以在整个ripple网络中流通，总数量为1000亿，并且随着交易的增多而逐渐减少，瑞波币的运营公司为Ripple Labs（其前身为OpenCoin）。
瑞波币是ripple系统中唯一的通用货币，其不同于ripple系统中的其他货币，其他货币比如CNY、USD不能跨网关提现的，换句话说，A网关发行的CNY只能在A网关提现，若想在B网关提现，必须通过ripple系统的挂单功能转化为B网关的CNY才可以到B网关提现。而瑞波币完全没有这方面的限制，它在ripple系统内是通用的。
瑞波币（XRP）和比特币一样都是基于数学和密码学的数字货币，但是与比特币没有真正的用途不同，XRP在Ripple系统中有主要桥梁货币和有保障安全的功能，其中保障安全的功能是不可或缺的，这要求参与这个协议的网关都必须持有少量XRP。
纪念币人物：Chris Larsen
人物国籍：美国
人物身份：瑞波币联合创始人兼CEO
人物介绍：他拥有斯坦福大学MBA学位，曾做过贷款公司，在2017年瑞波币价格最高时，他的个人资产曾达到570亿美元，一跃成为福布斯世界排名第九的富豪，财富增长所用的时间超过福布斯任何一位富豪，真验证了那句名言：“币圈一夜，人间一年。”其他类型的加密货币都试图打破银行的中心化垄断，而他的瑞波币确反其道而行之，企图和银行合作，促进银行转账支付，真是链圈一朵奇葩！
      </div>
      <div class="introtext" v-if="cointype === coins[21].cointype">
波场币介绍：波场 TRON 以推动互联网去中心化为己任，致力于为去中心化互联网搭建基础设施。旗下的波场 TRON 协议是全球最大的基于区块链的去中心化应用操作系统协议之一，为协议上的去中心化应用运行提供高吞吐，高扩展，高可靠性的底层公链支持。波场 TRON 公链宣称每秒交易速度（TPS）将超过数万，进而可以支持更多的应用场景，并且通过用户免费使用和强激励的方式，最大限度调动生态参与者的积极性，不仅可以满足线上去中心化娱乐等应用的高并发、低延迟和海量数据传输的苛刻要求，而且也给普通互联网用户最佳的去中心化用户体验。开发者可以使用波场 TRON 协议与虚拟机开发属于自己和社区的应用，使用智能合约进行分布式众筹，数字资产发行。波场 TRON 协议已经运行着包括陪我 APP，BitTorrent 等去中心化应用，活跃用户突破一亿，分布于全球超过100个国家地区。
纪念币人物：孙宇晨
人物国籍：中国
人物身份：波场币创始人
人物介绍：孙宇晨生于1990年，出生地是青海西宁，成长于广东惠州，高中时本沉迷文学成绩稳居全班倒数前十，后在高三奋勇直追，并凭借第九届新概念作文获奖契机，获得北大降分录取机会，得以进入北大。2011年，他选择出国，就读宾夕法尼亚大学。2012年即开始接触比特币社区，2013年加入Ripple并担任Ripple大中华区首席代表，帮助Ripple成功完成IDG/Accel A轮3000万美金融资，助力Ripple成为全球前三的虚拟货币系统，是全球区块链行业的资深元老。2014年，孙宇晨又创办了语音直播平台陪我APP，现已成为世界最大的中文声优声控社区。随后他又创立波场。凭借众多耀眼的成就，孙宇晨先后三次登上福布斯30位30岁以下创业者榜单，并当选为达沃斯论坛全球杰出青年。
      </div>
    </div>
  </div>
</template>

<script>
const allcoins = require("../assets/coins.json");
export default {
  name: 'introduction',
  data () {
    return {
      coins: allcoins,
      coin: {},
      cointype: "BIT"
    }
  },
  created: function(){
    this.cointype = this.$route.params.cointype;
    for(const typeid in this.coins){
      const type = this.coins[typeid];
      if(type.cointype == this.cointype){
        this.coin = this.coins[typeid];
      }
    }
  }
}
</script>

<style scoped>
.introtext{
  text-align:center
}
</style>
